Revit 2026 API

# PrintSetupDelete Method

---

Delete the current print setting, and make the In-Session setting as the current one.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Delete()
```
```vb
Public Function Delete As Boolean
```
```cpp
public:
bool Delete()
```
```fsharp
member Delete : unit -> bool
```

#### Return Value

BooleanFalse if Delete operation fails, otherwise true.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the current print setting is In-Session. |

#### Reference

PrintSetup Class

Autodesk.Revit.DB Namespace